results/final4/default-config-real-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: steps.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m30s max duration (incl. graceful stop):
              * steps: Up to 50 looping VUs for 3m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 01/50 VUs, 0 complete and 0 interrupted iterations
steps   [   0% ] 01/50 VUs  0m00.9s/3m00.0s
.
.
.
running (3m19.9s), 06/50 VUs, 61 complete and 33 interrupted iterations
steps ↓ [ 100% ] 50/50 VUs  3m0s


  █ THRESHOLDS 

    step_complete
    ✓ 'p(95)<60000' p(95)=11.76s

    step_payment_session
    ✓ 'p(95)<60000' p(95)=2.16s


  █ TOTAL RESULTS 

    checks_total.......: 368     1.835688/s
    checks_succeeded...: 100.00% 368 out of 368
    checks_failed......: 0.00%   0 out of 368

    ✓ list products 200
    ✓ create cart 200
    ✓ add line item 200
    ✓ complete cart 200

    CUSTOM
    completed_checkouts............: 68     0.339203/s
    step_add_item..................: avg=23.98s min=8.47s  med=21.46s max=42.8s  p(90)=40.33s p(95)=41.06s
    step_addresses.................: avg=11.23s min=6.06s  med=7.69s  max=29.31s p(90)=26.57s p(95)=27.65s
    step_browse....................: avg=8.15s  min=1.94s  med=5.55s  max=19.16s p(90)=16.83s p(95)=17.46s
    step_complete..................: avg=9.65s  min=4.39s  med=10.46s max=11.96s p(90)=11.62s p(95)=11.76s
    step_create_cart...............: avg=14.53s min=5.23s  med=8.79s  max=27.32s p(90)=25.99s p(95)=26.46s
    step_payment_collection........: avg=2.75s  min=2.07s  med=2.82s  max=3.5s   p(90)=3.12s  p(95)=3.19s 
    step_payment_session...........: avg=1.84s  min=1.31s  med=1.87s  max=2.22s  p(90)=2.06s  p(95)=2.16s 
    step_shipping..................: avg=16.51s min=15.05s med=16.43s max=21.74s p(90)=17.25s p(95)=17.45s

    HTTP
    http_req_duration..............: avg=10.85s min=1.31s  med=7.49s  max=42.8s  p(90)=25.68s p(95)=34.42s
      { expected_response:true }...: avg=10.85s min=1.31s  med=7.49s  max=42.8s  p(90)=25.68s p(95)=34.42s
    http_req_failed................: 0.00%  0 out of 796
    http_reqs......................: 796    3.970673/s

    EXECUTION
    iteration_duration.............: avg=1m51s  min=1m0s   med=2m5s   max=2m10s  p(90)=2m10s  p(95)=2m10s 
    iterations.....................: 66     0.329227/s
    vus............................: 6      min=1        max=50
    vus_max........................: 50     min=50       max=50

    NETWORK
    data_received..................: 12 MB  59 kB/s
    data_sent......................: 274 kB 1.4 kB/s



running (3m20.5s), 00/50 VUs, 66 complete and 34 interrupted iterations
steps ✓ [ 100% ] 00/50 VUs  3m0s